{
  "tweets": [
    {
      "id": "1908169692868456779",
      "content": "GENZs MUST Be Stopped from Using Social Media to Fight For Justice!!NIS Boss Noordin Haji Vows!",
      "user": "@MutembeiTV",
      "timestamp": "2025-04-04T14:48:01.000Z",
      "likes": 274,
      "retweets": 116,
      "has_photos": false
    },
    {
      "id": "1908414552221364627",
      "content": "CUSHITIC PIECES OF SHIT: \n\nYou know, everything William Ruto is attempting to do these days, is to undo the work that his two cushitic dogs Mohammed Amin and Noordin Haji did of abductions, enforced disappearances and extrajudicial killings. \n\nNobody has and will ever forget",
      "user": "@FGaitho237",
      "timestamp": "2025-04-05T07:01:00.000Z",
      "likes": 51,
      "retweets": 21,
      "has_photos": true
    },
    {
      "id": "1908382717525508210",
      "content": "I could be living my life like this spending less time on X but then cushitic pieces of shit Mohammed Amin and Noordin Haji decided to hunt me down on nonsensical bullshit all because I’m Kikuyu and it’s the tribe they were antagonizing because of their choreographed beefs with",
      "user": "@FGaitho237",
      "timestamp": "2025-04-05T04:54:30.000Z",
      "likes": 100,
      "retweets": 17,
      "has_photos": false
    },
    {
      "id": "1907978605453259146",
      "content": "After abducting and killing Kenyans profiled by their ethnic communities to align with Ruto’s psychotic agenda, Cushitic piece of shit Noordin Haji bought a new shirt to commemorate his spectacular genocide. \n\nMakofi kwake. Muuaji mashuhuri.",
      "user": "@FGaitho237",
      "timestamp": "2025-04-04T02:08:42.000Z",
      "likes": 627,
      "retweets": 171,
      "has_photos": true
    },
    {
      "id": "1907860346661925226",
      "content": "Social Media Critics Warned, Again!\n\nNIS DG Noordin Haji has reiterated that the increasing misuse of social media remains a significant security threat\n\nJust a week ago, Haji urged Kenyans to refrain from spread divisive political content.\n\n#NTVTonight \n@Ben_Kitili\n @RuthSarmwei",
      "user": "@ntvkenya",
      "timestamp": "2025-04-03T18:18:47.000Z",
      "likes": 302,
      "retweets": 199,
      "has_photos": true
    },
    {
      "id": "1908415242465665412",
      "content": "The Director General of the National Intelligence Service (NIS), Mr. Noordin Haji, has addressed a matter of fundamental importance to the preservation of national stability and the integrity of democratic governance.\n\nMany Kenyans continue to misunderstand the intention behind",
      "user": "@Gideon_Kitheka",
      "timestamp": "2025-04-05T07:03:45.000Z",
      "likes": 11,
      "retweets": 11,
      "has_photos": false
    },
    {
      "id": "1908410445792502209",
      "content": "I commend the firm and focused stance taken by the Director General of the National Intelligence Service, Mr. Noordin Haji, during the Mashariki Conference, particularly on the urgent threat posed by disinformation, misinformation, and propaganda. His message is timely and",
      "user": "@MRSMuruguu",
      "timestamp": "2025-04-05T06:44:41.000Z",
      "likes": 22,
      "retweets": 16,
      "has_photos": false
    },
    {
      "id": "1908109206093222037",
      "content": "Noordin Haji MUST know that we are not scared of dead snakes\n\nWe have freedom of speech, expression and of mass media\n\nDo not call criticism a threat to national security\n\nThe only threat to national security is Haji, Ruto and fellow abductors\n\nWe will not be cowed",
      "user": "@_James041",
      "timestamp": "2025-04-04T10:47:40.000Z",
      "likes": 563,
      "retweets": 188,
      "has_photos": false
    },
    {
      "id": "1908063302845894751",
      "content": "NIS DG Noordin Haji raised concerns about the impact of misinformation online, eroding public trust and deepening divisions. He called for coordinated strategies among African nations to address these digital threats urgently.",
      "user": "@PHIAMAX",
      "timestamp": "2025-04-04T07:45:16.000Z",
      "likes": 66,
      "retweets": 16,
      "has_photos": false
    },
    {
      "id": "1908129300047356062",
      "content": "Keeping up with \n@AmnestyKenya\n Director \n@irunguhoughton\n’s trip to the USA. Yesterday he met with Kenyans living in the Bay Area. \n\nComplaints that there was no punch as regards to abductions, enforced disappearances and extrajudicial killings executed by Noordin Haji and Mohammed",
      "user": "@FGaitho237",
      "timestamp": "2025-04-04T12:07:31.000Z",
      "likes": 52,
      "retweets": 13,
      "has_photos": true
    }
  ],
  "trend": "Noordin Haji",
  "count": 10
}